app/controllers/movies_controller.rb

  def index
    @movies = Movie.all
---
SELECT "movies".* FROM "movies"

  def show
    id = params[:id] # retrieve movie ID from URI route
    @movie = Movie.find(id) # look up movie by unique ID
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    params.require(:movie)
    permitted = params[:movie].permit(:title,:rating,:release_date)
    @movie = Movie.create!(permitted)
---
INSERT INTO "movies" ("title", "rating", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "no game no life"], ["rating", "PG-13"], ["release_date", "2015-11-02 00:00:00"], ["created_at", "2020-08-21 17:40:08.232354"], ["updated_at", "2020-08-21 17:40:08.232354"]]

  def edit
    @movie = Movie.find params[:id]
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @movie = Movie.find params[:id]
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    @movie = Movie.find(params[:id])
    @movie.destroy
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 1]]